
&НаСервере
Процедура КомандаЗаполнитьСправочникНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Контрагенты.НаименованиеПолное КАК НаименованиеПолное,
		|	Контрагенты.Наименование КАК Наименование,
		|	Контрагенты.ИНН КАК ИНН,
		|	Контрагенты.КПП КАК КПП,
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ЭтоГруппа = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Структура = Новый Структура;
		Структура.Вставить("Наименование"		, ВыборкаДетальныеЗаписи.Наименование);
		Структура.Вставить("НаименованиеПолное"	, ВыборкаДетальныеЗаписи.НаименованиеПолное);
		Структура.Вставить("ИНН"				, ВыборкаДетальныеЗаписи.ИНН);
		Структура.Вставить("КПП"				, ВыборкаДетальныеЗаписи.КПП);	
		
		ПараметрыОтчета = Новый Структура;   
		
		ПараметрыОтчета.Вставить("ИНН"							,ВыборкаДетальныеЗаписи.ИНН);
		ПараметрыОтчета.Вставить("ИдентификаторФормы"			,"");
		ПараметрыОтчета.Вставить("Контрагент"					,ВыборкаДетальныеЗаписи.Ссылка);
		ПараметрыОтчета.Вставить("СостояниеОтчета"				,"");
		ПараметрыОтчета.Вставить("СостояниеПроверки"			,"");
		ПараметрыОтчета.Вставить("СостояниеСобытияМониторинга"	,"");   
		ПараметрыОтчета.Вставить("СостояниеФакторыРиска"		,"");
		
		РС_ОбщийМодульСервер.ПроверкаКонтрагентовНаСервере(ПараметрыОтчета);
		
		КонтрагентРС = СоздатьКонтрагентаРС(Структура);
		
		РС_ОбщийМодульСервер.ЗаполнитьКИ(КонтрагентРС, ВыборкаДетальныеЗаписи.Ссылка);
		
		РС_ОбщийМодульСервер.ЗаполнитьОКВЕД2(КонтрагентРС, ВыборкаДетальныеЗаписи.Ссылка);

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьСправочник(Команда)
	КомандаЗаполнитьСправочникНаСервере();
КонецПроцедуры

&НаСервере
Функция СоздатьКонтрагентаРС(Структура)
			
	ПоискКонтрагент = НайтиКонтрагента(Структура);
	
	Если ЗначениеЗаполнено(ПоискКонтрагент) Тогда 
		НовыйЭлемент = ПоискКонтрагент.ПолучитьОбъект();
	Иначе
		НовыйЭлемент = Справочники.РС_Контрагенты.СоздатьЭлемент();	
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, Структура);
		
	НовыйЭлемент.Записать();
	
	Возврат НовыйЭлемент.Ссылка;
		
КонецФункции	   

&НаСервере
Функция НайтиКонтрагента(Структура)
	нКонрагент = Справочники.Контрагенты.ПустаяСсылка();
	
	КонтрагентПоИННКПП = НайтиКонтрагентаПоИННКПП(Структура);
	
	Если ЗначениеЗаполнено(КонтрагентПоИННКПП) Тогда 
		нКонрагент = КонтрагентПоИННКПП;	
	Иначе 
		нКонрагент = Справочники.РС_Контрагенты.НайтиПоНаименованию(Структура.Наименование);	
	КонецЕсли;

	Возврат нКонрагент;
	
КонецФункции

&НаСервере
Функция НайтиКонтрагентаПоИННКПП(Структура)
	
	нКонрагент = Справочники.Контрагенты.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РС_Контрагенты.Ссылка КАК Контрагент
		|ИЗ
		|	Справочник.РС_Контрагенты КАК РС_Контрагенты
		|ГДЕ
		|	РС_Контрагенты.ИНН = &ИНН
		|	И РС_Контрагенты.КПП = &КПП";
	
	Запрос.УстановитьПараметр("ИНН", Структура.ИНН);
	Запрос.УстановитьПараметр("КПП", Структура.КПП);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		 нКонрагент = ВыборкаДетальныеЗаписи.Контрагент;
	КонецЦикла;
	
	Возврат нКонрагент;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьКИНаСервере()
	// РС_ОбщийМодульСервер.ЗаполнитьКИ(КонтрагентРС, ВыборкаДетальныеЗаписи.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКИ(Команда)
	ЗаполнитьКИНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОКВЕД2НаСервере()
	// РС_ОбщийМодульСервер.ЗаполнитьОКВЕД2(КонтрагентРС, ВыборкаДетальныеЗаписи.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОКВЕД2(Команда)
	ЗаполнитьОКВЕД2НаСервере();
КонецПроцедуры
