
&НаСервере
Процедура КомандаЗаполнитьСправочникНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Контрагенты.НаименованиеПолное КАК НаименованиеПолное,
		|	Контрагенты.Наименование КАК Наименование,
		|	Контрагенты.ИНН КАК ИНН,
		|	Контрагенты.КПП КАК КПП,
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ЭтоГруппа = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Структура = Новый Структура;
		Структура.Вставить("Наименование"		, ВыборкаДетальныеЗаписи.Наименование);
		Структура.Вставить("НаименованиеПолное"	, ВыборкаДетальныеЗаписи.НаименованиеПолное);
		Структура.Вставить("ИНН"				, ВыборкаДетальныеЗаписи.ИНН);
		Структура.Вставить("КПП"				, ВыборкаДетальныеЗаписи.КПП);
		КонтрагентРС = СоздатьКонтрагентаРС(Структура);
		
		ЗаполнитьКИ(КонтрагентРС, ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьСправочник(Команда)
	КомандаЗаполнитьСправочникНаСервере();
КонецПроцедуры 

&НаСервере
Функция СоздатьКонтрагентаРС(Структура)
			
	ПоискКонтрагент = НайтиКонтрагента(Структура);
	
	Если ЗначениеЗаполнено(ПоискКонтрагент) Тогда 
		НовыйЭлемент = ПоискКонтрагент.ПолучитьОбъект();
	Иначе
		НовыйЭлемент = Справочники.РС_Контрагенты.СоздатьЭлемент();	
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, Структура);
		
	НовыйЭлемент.Записать();
	
	Возврат НовыйЭлемент.Ссылка;
	
КонецФункции	   

&НаСервере
Функция НайтиКонтрагента(Структура)
	нКонрагент = Справочники.Контрагенты.ПустаяСсылка();
	
	КонтрагентПоИННКПП = НайтиКонтрагентаПоИННКПП(Структура);
	
	Если ЗначениеЗаполнено(КонтрагентПоИННКПП) Тогда 
		нКонрагент = КонтрагентПоИННКПП;	
	Иначе 
		нКонрагент = Справочники.РС_Контрагенты.НайтиПоНаименованию(Структура.Наименование);	
	КонецЕсли;

	Возврат нКонрагент;
	
КонецФункции

&НаСервере
Функция НайтиКонтрагентаПоИННКПП(Структура)
	
	нКонрагент = Справочники.Контрагенты.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РС_Контрагенты.Ссылка КАК Контрагент
		|ИЗ
		|	Справочник.РС_Контрагенты КАК РС_Контрагенты
		|ГДЕ
		|	РС_Контрагенты.ИНН = &ИНН
		|	И РС_Контрагенты.КПП = &КПП";
	
	Запрос.УстановитьПараметр("ИНН", Структура.ИНН);
	Запрос.УстановитьПараметр("КПП", Структура.КПП);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		 нКонрагент = ВыборкаДетальныеЗаписи.Контрагент;
	КонецЦикла;
	
	Возврат нКонрагент;
	
КонецФункции	

&НаСервере
Процедура ЗаполнитьКИ(КонтрагентРС, Контрагент)
	
	СпрОбъект = КонтрагентРС.ПолучитьОбъект();
	
	СпрОбъект.КонтактнаяИнформация.Очистить();
	
	Для Каждого СтрокаКИ Из Контрагент.КонтактнаяИнформация Цикл  
		НоваяСтрока = СпрОбъект.КонтактнаяИнформация.Добавить(); 
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКИ);
	
		тВид = Справочники.РС_ВидыКонтактнойИнформации.НайтиПоНаименованию(СтрокаКИ.Вид.Наименование);
		Если Не ЗначениеЗаполнено(тВид) Тогда
			тВид = СоздатьпростойСправочник("РС_ВидыКонтактнойИнформации", СтрокаКИ.Вид.Наименование);
		КонецЕсли;
		НоваяСтрока.Вид = тВид;
		
		Если СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда 
			Адрес 	= УправлениеКонтактнойИнформациейСлужебный.JSONВКонтактнуюИнформациюПоПолям(СтрокаКИ.Значение, Перечисления.ТипыКонтактнойИнформации.Адрес); 
			
			тСтрана = Справочники.РС_Страны.НайтиПоНаименованию(Адрес.country);
			Если Не ЗначениеЗаполнено(тСтрана) Тогда 
				тСтрана = СоздатьпростойСправочник("РС_Страны", Адрес.country);
			КонецЕсли;                               
			НоваяСтрока.Страна = тСтрана; 
			
			тРегион = Справочники.РС_Регионы.НайтиПоНаименованию(Адрес.area);
			Если Не ЗначениеЗаполнено(тРегион) Тогда 
				тРегион = СоздатьпростойСправочник("РС_Регионы", Адрес.area);
			КонецЕсли;                               
			НоваяСтрока.Регион = тРегион; 
			
			тГород = Справочники.РС_Города.НайтиПоНаименованию(Адрес.city);
			Если Не ЗначениеЗаполнено(тГород) Тогда 
				тГород = СоздатьпростойСправочник("РС_Города", Адрес.city);
			КонецЕсли;                               
			НоваяСтрока.Город = тГород; 
		КонецЕсли;
		
	КонецЦикла;	
	
	СпрОбъект.Записать();
	
КонецПроцедуры

&НаСервере
Функция СоздатьпростойСправочник(Спр, Наименование) 
	
    тЭлемент = Справочники[Спр].СоздатьЭлемент();
	тЭлемент.Наименование = Наименование;
	тЭлемент.Записать();
	
	Возврат тЭлемент.Ссылка;
	
КонецФункции

&НаСервере
Функция СоздатьВидКИ(Наименование) 
	
    тЭлемент = Справочники.РС_ВидыКонтактнойИнформации.СоздатьЭлемент();
	тЭлемент.Наименование = Наименование;
	тЭлемент.Записать();
	
	Возврат тЭлемент.Ссылка;
	
КонецФункции
