
Процедура ЗаполнитьКИ(Приемник, Источник)  Экспорт
	
	//ЗаполнитьКИ(КонтрагентРС, Контрагент)
	
	СпрОбъект = Приемник.ПолучитьОбъект();
	
	СпрОбъект.КонтактнаяИнформация.Очистить();
	
	Для Каждого СтрокаКИ Из Источник.КонтактнаяИнформация Цикл  
		НоваяСтрока = СпрОбъект.КонтактнаяИнформация.Добавить(); 
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКИ);
	
		тВид = Справочники.РС_ВидыКонтактнойИнформации.НайтиПоНаименованию(СтрокаКИ.Вид.Наименование);
		Если Не ЗначениеЗаполнено(тВид) Тогда
			тВид = СоздатьпростойСправочник("РС_ВидыКонтактнойИнформации", СтрокаКИ.Вид.Наименование);
		КонецЕсли;
		НоваяСтрока.Вид = тВид;
		
		Если СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда 
			Адрес 	= УправлениеКонтактнойИнформациейСлужебный.JSONВКонтактнуюИнформациюПоПолям(СтрокаКИ.Значение, Перечисления.ТипыКонтактнойИнформации.Адрес); 
			
			тСтрана = Справочники.РС_Страны.НайтиПоНаименованию(Адрес.country);
			Если Не ЗначениеЗаполнено(тСтрана) Тогда 
				тСтрана = СоздатьпростойСправочник("РС_Страны", Адрес.country);
			КонецЕсли;                               
			НоваяСтрока.Страна = тСтрана; 
			
			тРегион = Справочники.РС_Регионы.НайтиПоНаименованию(Адрес.area);
			Если Не ЗначениеЗаполнено(тРегион) Тогда 
				тРегион = СоздатьпростойСправочник("РС_Регионы", Адрес.area);
			КонецЕсли;                               
			НоваяСтрока.Регион = тРегион; 
			
			тГород = Справочники.РС_Города.НайтиПоНаименованию(Адрес.city);
			Если Не ЗначениеЗаполнено(тГород) Тогда 
				тГород = СоздатьпростойСправочник("РС_Города", Адрес.city);
			КонецЕсли;                               
			НоваяСтрока.Город = тГород; 
		КонецЕсли;
		
	КонецЦикла;	
	
	СпрОбъект.Записать();
	
КонецПроцедуры

Функция СоздатьпростойСправочник(Спр, Наименование) 
	
    тЭлемент = Справочники[Спр].СоздатьЭлемент();
	тЭлемент.Наименование = Наименование;
	тЭлемент.Записать();
	
	Возврат тЭлемент.Ссылка;
	
КонецФункции