&НаСервере
Функция ПроверкаСеанса(лкИмя, ДопустимоеКоличество)Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		лк_ВсеСеансы = ПолучитьСеансыИнформационнойБазы();
		
		лк_ТабСеансовПользователя = Новый ТаблицаЗначений;
		лк_ТабСеансовПользователя.Колонки.Добавить("Пользователь");
		лк_ТабСеансовПользователя.Колонки.Добавить("КоличествоОткрытыхСеансов");
		
		лк_ИмяПользователя = СокрЛП(?(ЗначениеЗаполнено(ПараметрыСеанса.ТекущийПользователь),
		ПараметрыСеанса.ТекущийПользователь,
		ПараметрыСеанса.ТекущийВнешнийПользователь));
		
		Для Каждого Эл_овп_Сеансы Из лк_ВсеСеансы Цикл
			Если СокрЛП(Эл_овп_Сеансы.Пользователь.ПолноеИмя) = лк_ИмяПользователя 
				И ЗначениеЗаполнено(Эл_овп_Сеансы.IPАдресКлиента)  Тогда
				НовСтр_овп_ТабСеансовПользователя = лк_ТабСеансовПользователя.Добавить();
				НовСтр_овп_ТабСеансовПользователя.Пользователь = СокрЛП(Эл_овп_Сеансы.Пользователь);
				НовСтр_овп_ТабСеансовПользователя.КоличествоОткрытыхСеансов = 1;
			КонецЕсли;	
		КонецЦикла;
		
		лк_ТабСеансовПользователя.Свернуть("Пользователь", "КоличествоОткрытыхСеансов");
		
		Если  лк_ТабСеансовПользователя.Количество()>0 Тогда 
			Если лк_ТабСеансовПользователя.Получить(0).КоличествоОткрытыхСеансов > ДопустимоеКоличество Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Возврат Ложь;

КонецФункции    

Процедура ЗаполнитьКИ(Приемник, Источник)  Экспорт
		
	СпрОбъект = Приемник.ПолучитьОбъект();
	
	СпрОбъект.КонтактнаяИнформация.Очистить();
	
	Для Каждого СтрокаКИ Из Источник.КонтактнаяИнформация Цикл  
		НоваяСтрока = СпрОбъект.КонтактнаяИнформация.Добавить(); 
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКИ);
	
		тВид = Справочники.РС_ВидыКонтактнойИнформации.НайтиПоНаименованию(СтрокаКИ.Вид.Наименование);
		Если Не ЗначениеЗаполнено(тВид) Тогда
			тВид = СоздатьпростойСправочник("РС_ВидыКонтактнойИнформации", СтрокаКИ.Вид.Наименование);
		КонецЕсли;
		НоваяСтрока.Вид = тВид;
		
		Если СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда 
			Адрес 	= УправлениеКонтактнойИнформациейСлужебный.JSONВКонтактнуюИнформациюПоПолям(СтрокаКИ.Значение, Перечисления.ТипыКонтактнойИнформации.Адрес); 
			
			тСтрана = Справочники.РС_Страны.НайтиПоНаименованию(Адрес.country);
			Если Не ЗначениеЗаполнено(тСтрана) Тогда 
				тСтрана = СоздатьпростойСправочник("РС_Страны", Адрес.country);
			КонецЕсли;                               
			НоваяСтрока.Страна = тСтрана; 
			
			тРегион = Справочники.РС_Регионы.НайтиПоНаименованию(Адрес.area);
			Если Не ЗначениеЗаполнено(тРегион) Тогда 
				тРегион = СоздатьпростойСправочник("РС_Регионы", Адрес.area);
			КонецЕсли;                               
			НоваяСтрока.Регион = тРегион; 
			
			тГород = Справочники.РС_Города.НайтиПоНаименованию(Адрес.city);
			Если Не ЗначениеЗаполнено(тГород) Тогда 
				тГород = СоздатьпростойСправочник("РС_Города", Адрес.city);
			КонецЕсли;                               
			НоваяСтрока.Город = тГород; 
		КонецЕсли;
		
	КонецЦикла;	
	
	СпрОбъект.Записать();
	
КонецПроцедуры

Процедура ЗаполнитьОКВЕД2(Приемник, Источник)  Экспорт
	
	СпрОбъект = Приемник.ПолучитьОбъект();
	
	СпрОбъект.ДополнительныеОКВЭД.Очистить();
	
	СпрОбъект.ОКВЭД2 = Источник.РС_ОКВЭД2;
	
	Для Каждого СтрокаОКВЭД Из Источник.РС_ДополнительныеОКВЭД Цикл
		НоваяСтрока = СпрОбъект.ДополнительныеОКВЭД.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОКВЭД); 
	КонецЦикла;
	
	СпрОбъект.Записать();
	
КонецПроцедуры

Функция СоздатьпростойСправочник(Спр, Наименование) 
	
    тЭлемент = Справочники[Спр].СоздатьЭлемент();
	тЭлемент.Наименование = Наименование;
	тЭлемент.Записать();
	
	Возврат тЭлемент.Ссылка;
	
КонецФункции 

Функция ДобавитьЭлементОКВЭД2(Код, Имя) Экспорт 
	
	НовыйЭлемент = Справочники.КлассификаторОКВЭД2.СоздатьЭлемент();
	НовыйЭлемент.Код 				= Код;	
	НовыйЭлемент.Наименование   	= Имя;
	НовыйЭлемент.НаименованиеПолное = Имя;
	НовыйЭлемент.Записать();
	
	Возврат НовыйЭлемент.Ссылка;
	
КонецФункции  

Процедура ПроверкаКонтрагентовНаСервере(ПараметрыОтчета) Экспорт   
	Попытка
		РезультатПроверки 		= Обработки.ПроверкаКонтрагента.ДанныеКарточкиКонтрагента(ПараметрыОтчета);
		МассивДополнительные 	= РезультатПроверки.ДанныеПроверкиКонтрагента.КарточкаВидыДеятельности.Дополнительные; 	
		ОсновнойВид 			= РезультатПроверки.ДанныеПроверкиКонтрагента.КарточкаВидыДеятельности.ОсновнойВид;
		
		поискОснОКВЭД2 = Справочники.КлассификаторОКВЭД2.НайтиПоКоду(ОсновнойВид.Код);
		
		Если НЕ ЗначениеЗаполнено(поискОснОКВЭД2) Тогда	
			поискОснОКВЭД2 = ДобавитьЭлементОКВЭД2(ОсновнойВид.Код, ОсновнойВид.Наименование);	
		КонецЕсли;  
		
		КонтрагентОбъект = ПараметрыОтчета.Контрагент.ПолучитьОбъект();
		
		КонтрагентОбъект.РС_ОКВЭД2 = поискОснОКВЭД2;
		
		Если МассивДополнительные.Количество() > 0 Тогда 
			КонтрагентОбъект.РС_ДополнительныеОКВЭД.Очистить();		
			Для Каждого СтрДополнительно Из МассивДополнительные Цикл;
				НоваяСтрока = КонтрагентОбъект.РС_ДополнительныеОКВЭД.Добавить();
				НоваяСтрока.КодОКВЭД 			=  СтрДополнительно.Код;
				НоваяСтрока.НаименованиеПолное 	=  СтрДополнительно.Наименование;
				
				поискОКВЭД2 = Справочники.КлассификаторОКВЭД2.НайтиПоКоду(СтрДополнительно.Код);
				
				Если Не ЗначениеЗаполнено(поискОКВЭД2) Тогда 
					поискОКВЭД2 = ДобавитьЭлементОКВЭД2(СтрДополнительно.Код, СтрДополнительно.Наименование);	
				КонецЕсли;
				
				НоваяСтрока.ОКВЭД2 = поискОКВЭД2;
			КонецЦикла;
		КонецЕсли; 
		
		КонтрагентОбъект.Записать();
	Исключение
	КонецПопытки;
КонецПроцедуры
