
&НаСервере
Процедура КомандаЗаполнитьСправочникНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КонтактныеЛица.Ссылка КАК Ссылка,
		|	КонтактныеЛица.Наименование КАК Наименование,
		|	КонтактныеЛица.Фамилия КАК Фамилия,
		|	КонтактныеЛица.Имя КАК Имя,
		|	КонтактныеЛица.Отчество КАК Отчество,
		|	КонтактныеЛица.ДатаРождения КАК ДатаРождения,
		|	КонтактныеЛица.ОбъектВладелец КАК КонтрагентБД
		|ИЗ
		|	Справочник.КонтактныеЛица КАК КонтактныеЛица
		|ГДЕ
		|	КонтактныеЛица.ОбъектВладелец ССЫЛКА Справочник.Контрагенты";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Структура = Новый Структура;
		Структура.Вставить("Наименование"	, ВыборкаДетальныеЗаписи.Наименование);
		Структура.Вставить("Фамилия"		, ВыборкаДетальныеЗаписи.Фамилия);
		Структура.Вставить("Имя"			, ВыборкаДетальныеЗаписи.Имя);
		Структура.Вставить("Отчество"		, ВыборкаДетальныеЗаписи.Отчество);
		Структура.Вставить("ДатаРождения"	, ВыборкаДетальныеЗаписи.ДатаРождения);
		Структура.Вставить("КонтрагентБД"	, ВыборкаДетальныеЗаписи.КонтрагентБД);
		
		КонтактноеЛицоРС = СоздатьКонтактноеЛицоРС(Структура); 
		
		РС_ОбщийМодульСервер.ЗаполнитьКИ(КонтактноеЛицоРС, ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьСправочник(Команда)
	КомандаЗаполнитьСправочникНаСервере();
КонецПроцедуры

&НаСервере
Функция СоздатьКонтактноеЛицоРС(Структура)
			
	ПоискКЛ = НайтиКонтактноеЛицо(Структура);
	
	Если ЗначениеЗаполнено(ПоискКЛ) Тогда 
		НовыйЭлемент = ПоискКЛ.ПолучитьОбъект();
	Иначе
		НовыйЭлемент = Справочники.РС_КонтактныеЛица.СоздатьЭлемент();	
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, Структура);
		
	НовыйЭлемент.Записать();
	
	Возврат НовыйЭлемент.Ссылка;
	
КонецФункции  

&НаСервере
Функция НайтиКонтактноеЛицо(Структура)
	
	ПоискКЛ = Справочники.РС_КонтактныеЛица.ПустаяСсылка();  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РС_КонтактныеЛица.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.РС_КонтактныеЛица КАК РС_КонтактныеЛица
		|ГДЕ
		|	РС_КонтактныеЛица.КонтрагентБД = &КонтрагентБД
		|	И РС_КонтактныеЛица.Имя = &Имя
		|	И РС_КонтактныеЛица.Фамилия = &Фамилия
		|	И РС_КонтактныеЛица.Отчество = &Отчество
		|	И РС_КонтактныеЛица.ДатаРождения = &ДатаРождения";
	
	Запрос.УстановитьПараметр("ДатаРождения", Структура.ДатаРождения);
	Запрос.УстановитьПараметр("Имя"			, Структура.Имя);
	Запрос.УстановитьПараметр("КонтрагентБД", Структура.КонтрагентБД);
	Запрос.УстановитьПараметр("Отчество"	, Структура.Отчество);
	Запрос.УстановитьПараметр("Фамилия"		, Структура.Фамилия);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПоискКЛ = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	 
	 Возврат ПоискКЛ;
	
КонецФункции;

	