
&НаСервере
Процедура КомандаЗаполнитьСправочникНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ФизическиеЛица.Ссылка КАК Ссылка,
	|	ФизическиеЛица.Наименование КАК Наименование,
	|	ФизическиеЛица.ДатаРождения КАК ДатаРождения,
	|	ФизическиеЛица.ИНН КАК ИНН,
	|	ФизическиеЛица.ФИО КАК ФИО,
	|	ФизическиеЛица.Фамилия КАК Фамилия,
	|	ФизическиеЛица.Имя КАК Имя,
	|	ФизическиеЛица.Отчество КАК Отчество
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|ГДЕ
	|	ФизическиеЛица.ЭтоГруппа = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Табл = РезультатЗапроса.Выгрузить();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Структура = Новый Структура;
		Структура.Вставить("Наименование"	, ВыборкаДетальныеЗаписи.Наименование);
		Структура.Вставить("Фамилия"		, ВыборкаДетальныеЗаписи.Фамилия);
		Структура.Вставить("Имя"			, ВыборкаДетальныеЗаписи.Имя);
		Структура.Вставить("Отчество"		, ВыборкаДетальныеЗаписи.Отчество);
		Структура.Вставить("ДатаРождения"	, ВыборкаДетальныеЗаписи.ДатаРождения);
		Структура.Вставить("ИНН"			, ВыборкаДетальныеЗаписи.ИНН);
		Структура.Вставить("ФИО"			, ВыборкаДетальныеЗаписи.ФИО);
		
		ФизЛицоРС = СоздатьФизЛицоРС(Структура); 
		
		РС_ОбщийМодульСервер.ЗаполнитьКИ(ФизЛицоРС, ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция СоздатьФизЛицоРС(Структура)
			
	ПоискФЛ = НайтиФизЛицо(Структура);
	
	Если ЗначениеЗаполнено(ПоискФЛ) Тогда 
		НовыйЭлемент = ПоискФЛ.ПолучитьОбъект();
	Иначе
		НовыйЭлемент = Справочники.РС_ФизическиеЛица.СоздатьЭлемент();	
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, Структура);
	
	Ист = Справочники.Организации.ОрганизацияПоУмолчанию(Неопределено);
	
	НовыйЭлемент.Источник = "" + Ист.ИНН + ", " + Ист.Наименование; 
	
	НовыйЭлемент.Записать();
	
	Возврат НовыйЭлемент.Ссылка;
	
КонецФункции 

&НаСервере
Функция НайтиФизЛицо(Структура)
	
	ПоискФЛ = Справочники.РС_ФизическиеЛица.ПустаяСсылка();  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РС_ФизическиеЛица.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.РС_ФизическиеЛица КАК РС_ФизическиеЛица
		|ГДЕ
		|	РС_ФизическиеЛица.ИНН = &ИНН
		|	И РС_ФизическиеЛица.ДатаРождения = &ДатаРождения
		|	И РС_ФизическиеЛица.Фамилия = &Фамилия
		|	И РС_ФизическиеЛица.Имя = &Имя
		|	И РС_ФизическиеЛица.Отчество = &Отчество";
	
	Запрос.УстановитьПараметр("ДатаРождения", Структура.ДатаРождения);
	Запрос.УстановитьПараметр("Имя"			, Структура.Имя);
	Запрос.УстановитьПараметр("ИНН"			, Структура.ИНН);
	Запрос.УстановитьПараметр("Отчество"	, Структура.Отчество);
	Запрос.УстановитьПараметр("Фамилия"		, Структура.Фамилия);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПоискФЛ = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	 
	 Возврат ПоискФЛ;
	
 КонецФункции

&НаКлиенте
Процедура КомандаЗаполнитьСправочник(Команда)
	КомандаЗаполнитьСправочникНаСервере();
КонецПроцедуры
